<?php
require_once 'config.php';

require_once(__DIR__ . '/app/config.php');


require  __DIR__ . '/partials/head.php';

?>

<?php require  __DIR__ . '/partials/header.php'; ?>


<div class="c-form c-comfirm">
  <h1 class="c-title">学習の初め方</h1>
  <div class="c-body">
    学ぶ方法！！！
    誰かに話すつもりで学習する
    原理原則に基づいて構造的に理解する


    ポモドーロテクニック
    25分集中して5分休憩する時間管理テクニック
    ・邪魔排除
    ・タイマー
    ・25分間没頭
    ・時間後5分休憩
    ・繰り返す

    5分休憩は、短期記憶から長期記憶に変換するため
    学習する場所を確保

    行き詰まり克服の方法
    ・集中モード
    知っていること
    わからないことが多いときれる
    ・拡散モード
    頭を使わない
    頭を休める

    学習とは、集中と拡散の2つのモードを行き来すること
    行き詰まったら休む

    積極的な姿勢
    ・自分の力で例題に取り組む
    ・学んだことを振り返る
    キーポイント
    ・簡単な言葉を使って説明できるようにする
    教えること前提

    絶対に忘れない学び方
    ・作業記憶は必ず長期記憶に入れる
    ・学んだら文章にかく　
    ・学んだら人に教える　ようやくする　アウトプットする
    ベスト3くらいに絞る

    2つの脳を持っている

    メタ認知
    自分が進んでいる方向が正しいのか監視してくれる
    ・課題を理解する
    ・ゴールを設定
    ・学習する
    ・修正する


    ウィリアム・ジェームズの名言
    心が変われば行動が変わる。
    行動が変われば習慣が変わる。
    習慣が変われば人格が変わる。
    人格が変われば運命が変わる。


    習慣の作り方
    複利で伸びる一つの習慣
    ・なりたいアイデンティティを作る
    ・習慣を魅力的にする
    やりたいこととやらなければならないことをセットで考える
    これをやったらこれができる
    例）
    一つ知識を獲得すると資格取得に近づく！！
    一日健康的な食生活をすると健康的に体重が減りスタイルがよくなる
    ・例外ルールを作る
    妨げになってしまうイレギュラーが起きた時のルールを作る
    ・何もやらないとゆうことを継続させない
    ・小さな習慣から始める
    約束を守ことができるか
    ・入り口のハードルを下げる
    完璧を求めない
    ・ゲーム感覚でやる
    楽しむ工夫
  </div>
</div>

<?php require  __DIR__ . '/partials/footer.php'; ?>
</body>

</html>
